#### Terraform Format and Style 🖌 `success` (ignored)
#### Terraform Initialization ⚙️ `success`
#### Terraform Validation 🤖 Success! The configuration is valid.


#### Terraform Plan 📖 `success`

<details><summary>Show Plan</summary>

```terraform
Note: Objects have changed outside of Terraform

Terraform detected the following changes made outside of Terraform since the
last "terraform apply":

  # module.github.module.repositories.github_repository.ginger2 has been changed
  ~ resource "github_repository" "ginger2" {
      ~ etag                   = "W/\"d36d7cbe4a9743b7caf897e959d30c97baa2eeeb6e949e59fea09b95bb658b5b\"" -> "W/\"8dd1e34ca9603cded5d388ec9f26b3f0cf344d20e2f5e61b1f89f23a8b400074\""
        id                     = "ginger2"
        name                   = "ginger2"
        # (25 unchanged attributes hidden)
    }
  # module.github.module.old_picardthibault.github_membership.membership has been deleted
  - resource "github_membership" "membership" {
      - etag     = "W/\"fae74ea3a84f774344fa6f38547db322caf5745d83ef292179f2eeb542cb23b0\"" -> null
      - id       = "simde-utc:picardthibault" -> null
      - role     = "member" -> null
      - username = "picardthibault" -> null
    }
  # module.github.module.old_picardthibault.github_team_membership.membership["application_utcbde"] has been deleted
  - resource "github_team_membership" "membership" {
      - etag     = "W/\"946eb79b47d328a7863353a3eb024f687202a8496b900ccdbae6b3036deb23de\"" -> null
      - id       = "3158184:picardthibault" -> null
      - role     = "member" -> null
      - team_id  = "3158184" -> null
      - username = "picardthibault" -> null
    }
  # module.github.github_team_repository.simde_terraform has been changed
  ~ resource "github_team_repository" "simde_terraform" {
      ~ etag       = "W/\"1072dd0d5e0a51d3f9886269bad52532244b5799482c72f18e79ca621b08855d\"" -> "W/\"a0144265e149a0a66bd7ed46b31f38d0db03a0bacff008760a00538fd28ca11f\""
        id         = "4217733:terraform"
        # (3 unchanged attributes hidden)
    }
  # module.github.github_repository.terraform has been changed
  ~ resource "github_repository" "terraform" {
      ~ etag                   = "W/\"0c4d2fa39cad4b8398be6b6f96007410ee68ce098a5583ff74068ba8f5a917d0\"" -> "W/\"2534d4a74a1dd1a5a93e75704794e9175db5940c0207feef0c188b8a67d1530f\""
        id                     = "terraform"
        name                   = "terraform"
        # (25 unchanged attributes hidden)
    }
  # module.github.github_team.woolly has been changed
  ~ resource "github_team" "woolly" {
      ~ etag          = "W/\"bac68df56e72fcd5943677403333b01bc5a539de747d24139da4bdaf2cdc68ca\"" -> "W/\"49ab1c8ee0a0f0fe1996a3db7330e06cd09affe5e273eb145c9c8c5af1875aeb\""
        id            = "3158208"
        name          = "Woolly"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.covoit_utc has been changed
  ~ resource "github_team" "covoit_utc" {
      ~ etag          = "W/\"d12612e958818b249fde5ca2f591f67bb5f336d75e957454328ba61858a0af29\"" -> "W/\"25c89b29dac02c198b621dce88c43351c827fca405bd601c82e7a295711e8041\""
        id            = "3158193"
        name          = "Covoit'UTC"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.locky has been changed
  ~ resource "github_team" "locky" {
      ~ etag          = "W/\"e0118e24b3e678537ebe82e62dcf747b74527a7bdccca335c3c5b8c8873c50d5\"" -> "W/\"ed865233f284c57b9961ed0f4d19dd99cb254d720f91b3616a0159695755412e\""
        id            = "3644328"
        name          = "Locky"
        # (4 unchanged attributes hidden)
    }
  # module.github.github_team.cloud has been changed
  ~ resource "github_team" "cloud" {
      ~ etag          = "W/\"e8e0d4dd72dce9c098bec8cab1479842072ee2686957c9c5b1aa93e24e8ae0ca\"" -> "W/\"cc339f919a55474e5b7ab10e543203543188410843952c54b1f498c38dae4f85\""
        id            = "3158186"
        name          = "Cloud"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.application_utcbde has been changed
  ~ resource "github_team" "application_utcbde" {
      ~ etag          = "W/\"c8bc545025f035158cd0c4c3cbd580a35c721edf6036ecfcec3d6b12170c5fcb\"" -> "W/\"7257b6b23f7b16255df96634c66a989961d5908ab81004ed8661109d65bc1b2c\""
        id            = "3158184"
        name          = "Application UTC/BDE"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.planner has been changed
  ~ resource "github_team" "planner" {
      ~ etag          = "W/\"3b5d60af4478b909d0b017f41a7ad237cbbfd6d7054415e19a314b563f4e3406\"" -> "W/\"ea11a751ea8f82d35f08eda12e01700ff0f50ac5b375f72e6e397e964501218b\""
        id            = "3158217"
        name          = "Planner"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.payutc has been changed
  ~ resource "github_team" "payutc" {
      ~ etag          = "W/\"e9f7d9283b2a184c08af382e45e0048a00c729242f7f560123340ff826fb2025\"" -> "W/\"337cf58fa6f556519407e7b12d44b857ed753ad99a64fdeb01d3261987eb5586\""
        id            = "3158200"
        name          = "PayUTC"
        # (5 unchanged attributes hidden)
    }
  # module.github.github_team.portail has been changed
  ~ resource "github_team" "portail" {
      ~ etag          = "W/\"acc7e68733df885f2098fff2ba361568e333dc2d5a9369ff7ffb04de0710db57\"" -> "W/\"228fd893936e91172a234c794ea9d1cb2fbd7a841628f16d644725e7e1ba26ad\""
        id            = "3158212"
        name          = "Portail"
        # (5 unchanged attributes hidden)
    }
  # module.github.module.victor_moreliere.github_membership.membership has been deleted
  - resource "github_membership" "membership" {
      - etag     = "W/\"410570709c65586ba76b820959825f93fbdbe868d0c913509fb97be58f1e9433\"" -> null
      - id       = "SiMDE-Projects:GalliusJulius" -> null
      - role     = "member" -> null
      - username = "GalliusJulius" -> null
    }

Unless you have made equivalent changes to your configuration, or ignored the
relevant attributes using ignore_changes, the following plan may include
actions to undo or respond to these changes.

─────────────────────────────────────────────────────────────────────────────

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # module.discord_simde.discord_channel_permission.integfev_general will be created
  + resource "discord_channel_permission" "integfev_general" {
      + allow        = 100764736
      + channel_id   = "778331758302593074"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.integfev_integfev will be created
  + resource "discord_channel_permission" "integfev_integfev" {
      + allow        = 100764736
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.integfev_notifications will be created
  + resource "discord_channel_permission" "integfev_notifications" {
      + allow        = 100762688
      + channel_id   = "778636669737369651"
      + deny         = 199937
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_channel_permission.integfev_spam will be created
  + resource "discord_channel_permission" "integfev_spam" {
      + allow        = 100764736
      + channel_id   = "816982749675913226"
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = (known after apply)
      + type         = "role"
    }

  # module.discord_simde.discord_role.admin will be updated in-place
  ~ resource "discord_role" "admin" {
        id          = "759778778212991066"
        name        = "Saint administrateur"
      ~ position    = 15 -> 16
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.bde will be updated in-place
  ~ resource "discord_role" "bde" {
      ~ color       = 14737408 -> 14721024
        id          = "811739466012164167"
        name        = "BDE"
      ~ position    = 6 -> 7
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.comet will be updated in-place
  ~ resource "discord_role" "comet" {
      ~ color       = 14737408 -> 14721024
        id          = "895025366974992434"
        name        = "COMET"
      ~ position    = 4 -> 5
        # (5 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.emploidut will be updated in-place
  ~ resource "discord_role" "emploidut" {
        id          = "814062042973339679"
        name        = "Emploi du temps"
      ~ position    = 5 -> 6
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.etuville will be updated in-place
  ~ resource "discord_role" "etuville" {
        id          = "886977202707648563"
        name        = "Etuville"
      ~ position    = 10 -> 11
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.gesasso will be updated in-place
  ~ resource "discord_role" "gesasso" {
        id          = "892342940226158603"
        name        = "Projet Gesasso"
      ~ position    = 7 -> 8
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integ will be updated in-place
  ~ resource "discord_role" "integ" {
        id          = "802911395758473247"
        name        = "Integ"
      ~ position    = 11 -> 12
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.integfev will be created
  + resource "discord_role" "integfev" {
      + color       = 14721024
      + hoist       = false
      + id          = (known after apply)
      + managed     = (known after apply)
      + mentionable = true
      + name        = "Integ Fev"
      + permissions = 103924288
      + position    = 4
      + server_id   = "759778767831957535"
    }

  # module.discord_simde.discord_role.jeffrey will be updated in-place
  ~ resource "discord_role" "jeffrey" {
        id          = "782684806961561660"
        name        = "Projet Jeffrey"
      ~ position    = 9 -> 10
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.payutc will be updated in-place
  ~ resource "discord_role" "payutc" {
        id          = "776093666267758604"
        name        = "Tim Pay'UTC"
      ~ position    = 13 -> 14
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.treso will be updated in-place
  ~ resource "discord_role" "treso" {
        id          = "777569554539741255"
        name        = "Projet Flairsou"
      ~ position    = 12 -> 13
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.woolly will be updated in-place
  ~ resource "discord_role" "woolly" {
        id          = "784568395907465216"
        name        = "Woolly"
      ~ position    = 8 -> 9
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.discord_role.zapier will be updated in-place
  ~ resource "discord_role" "zapier" {
        id          = "791043844132962315"
        name        = "Zapier"
      ~ position    = 14 -> 15
        # (6 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-admin.discord_category_channel.category will be updated in-place
  ~ resource "discord_category_channel" "category" {
        id        = "778331766016049173"
        name      = "private-admin"
      ~ position  = 10 -> 11
        # (2 unchanged attributes hidden)
    }

  # module.discord_simde.module.private-integfev.discord_category_channel.category will be created
  + resource "discord_category_channel" "category" {
      + id        = (known after apply)
      + name      = "private-integfev"
      + position  = 10
      + server_id = "759778767831957535"
      + type      = "category"
    }

  # module.discord_simde.module.private-integfev.discord_channel_permission.admin[0] will be created
  + resource "discord_channel_permission" "admin" {
      + allow        = 100696136
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778778212991066"
      + type         = "role"
    }

  # module.discord_simde.module.private-integfev.discord_channel_permission.member_denied[0] will be created
  + resource "discord_channel_permission" "member_denied" {
      + channel_id   = (known after apply)
      + deny         = 197889
      + id           = (known after apply)
      + overwrite_id = "759778776560828447"
      + type         = "role"
    }

  # module.discord_simde.module.private-integfev.discord_text_channel.text will be created
  + resource "discord_text_channel" "text" {
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-integfev"
      + nsfw                     = false
      + position                 = 0
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "text"
    }

  # module.discord_simde.module.private-integfev.discord_voice_channel.voice will be created
  + resource "discord_voice_channel" "voice" {
      + bitrate                  = 64000
      + category                 = (known after apply)
      + id                       = (known after apply)
      + name                     = "private-integfev"
      + position                 = 1
      + server_id                = "759778767831957535"
      + sync_perms_with_category = true
      + type                     = "voice"
    }

  # module.github.module.old_picardthibault.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "picardthibault"
    }

  # module.github.module.old_picardthibault.github_team_membership.membership["application_utcbde"] will be created
  + resource "github_team_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + team_id  = "3158184"
      + username = "picardthibault"
    }

  # module.github.module.victor_moreliere.github_membership.membership will be created
  + resource "github_membership" "membership" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + role     = "member"
      + username = "GalliusJulius"
    }

Plan: 13 to add, 13 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.
```

</details>

*Pusher: @cesar-richard, Action: `pull_request`, Working Directory: ``, Workflow: `Terraform CI`*